#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-XVZoawgN6g5cUjyJ

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository.quarkus_sqlite4j will be updated in-place
  ~ resource "github_repository" "quarkus_sqlite4j" {
      ~ full_name                   = "quarkiverse/quarkus-sqlite4j" -> (known after apply)
        id                          = "quarkus-sqlite4j"
      ~ name                        = "quarkus-sqlite4j" -> "quarkus-jdbc-sqlite4j"
      ~ topics                      = [
          + "jdbc",
          + "sqlite",
            # (1 unchanged element hidden)
        ]
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_team.quarkus_sqlite4j will be updated in-place
  ~ resource "github_team" "quarkus_sqlite4j" {
        id                        = "12113914"
      ~ name                      = "quarkiverse-sqlite4j" -> "quarkiverse-jdbc-sqlite4j"
      ~ slug                      = "quarkiverse-sqlite4j" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_sqlite4j must be replaced
-/+ resource "github_team_repository" "quarkus_sqlite4j" {
      ~ etag       = "W/"fa4e0f1242e3e874a9c82dc4f1768f00fa1e0ebab13bd39cac2f59a923dd4b4a"" -> (known after apply)
      ~ id         = "12113914:quarkus-sqlite4j" -> (known after apply)
      ~ repository = "quarkus-sqlite4j" -> "quarkus-jdbc-sqlite4j" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*